#include <iostream>// подключаем диблиотеку iostream
using namespace std; // используем пространство имем для ввода и вывода
int user();// создаем прототип функции
int main(){// начинаем функцыю main
user();// активируем фуккцыю user для запроса данных и обрободки логических данных
}// заканчиваем функцию main
int user(){// накинаем функцыю user
int a = 0; //инициируем переменную а
cout << "enter number" << endl; // запрашываем значение у пользователя
cin >> a;// присваеваем введенное чисто переменной а
if((a == 0) or (a == 1)) // делаем логическую модель исходя из условия
{
cout << "You picked 0 or 1" << endl; // выводим на екран при соблюдении логической задачи
}
else
{
cout << "Error" << endl; // выыодим при не соблюдении логической задачи
}
return (0); //возврошаем 0 и заканчиваем программу
}

