#include <iostream>// подключаем диблиотеку iostream
using namespace std; // используем пространство имем для ввода и вывода
int main(){// начинаем функцыю main
int a = 0;
cout << "enter the number 0-10 " << endl; // запрашываем значение у пользователя
cin >> a;
if((a >= 0) && (a <= 10) && (a!=5)){ //проверяем по 3 условиям
cout << a*10 << endl; // выводим значение умноженое на 10
return (0); //заканчиваем программу если истенна
}
else
{
cout << "enter the number 0-10 corect " << endl; // запрашываем значение повторно если лож
cin >> a;
if((a >= 0) && (a <= 10) && (a!=5)){ //проверяем повторно
cout << a*10 << endl; // если правильно на второй раз то выводим результат
}
}
}// заканчиваем функцию main
